Repository: Gaoyifei1011/GetStoreApp
Catalog: GetStoreApp/Strings/*/About.resw
Source language: en_us
Languages: ar, zh_hans

# AppInformation
source: View app information
ar: عرض معلومات التطبيق
zh_hans: 查看应用信息

# AppSettings
source: Open App settings
ar: فتح إعدادات التطبيق
zh_hans: 打开应用设置

# AppVersion
source: Application Version:
ar: إصدار التطبيق:
zh_hans: 应用版本：{0}

# BeginnerGuide
source: Beginner's guide
ar: دليل المبتدئين
zh_hans: 新手指南

# BlockMapButton
source: Learn about BlockMap files
ar: تعرف على ملفات BlockMap
zh_hans: 了解包块映射文件

# BlockMapInstruction
source: The package block map file is an XML document that contains a list of the app’s files along with indexes and cryptographic hashes for each block of data that is stored in the package.
ar: ملف خريطة الكتلة للحزمة هو مستند XML يحتوي على قائمة بملفات التطبيق مع الفهارس والتجزئة التشفيرية لكل كتلة بيانات مخزنة في الحزمة.
zh_hans: 包块映射文件是一个XML文档，其中包含应用的文件列表，以及存储在包中的每个数据块的索引和加密哈希

# BriefIntroduction
source: App brief introduction
ar: مقدمة موجزة للتطبيق
zh_hans: 应用简介

source: Checking
ar: جارٍ الفحص

# CheckNetwork
source: Check the network
ar: تحقق من الشبكة
zh_hans: 检查网络

source: Check Update
ar: تحقق من التحديث
zh_hans: 检查更新

# ConsoleLaunch
source: Console program parameters
ar: معلمات برنامج وحدة التحكم
zh_hans: 控制台程序参数

source: Data storage
ar: تخزين البيانات
zh_hans: 数据存储

# DataStorageDescription
source: The app's data is stored as an XML document that you can access in your local directory. When accessing a datastore file, do not arbitrarily modify any of the contents of the datastore file. If the app fails to launch due to modification of the file contents, reset the app.
ar: تُخزن بيانات التطبيق كمستند XML يمكنك الوصول إليه في الدليل المحلي الخاص بك. عند الوصول إلى ملف تخزين البيانات، لا تقم بتعديل أي من محتويات ملف تخزين البيانات بشكل عشوائي. إذا فشل التطبيق في الإطلاق بسبب تعديل محتويات الملف، قم بإعادة تعيين التطبيق.
zh_hans: 应用的数据存储现在已经切换为XML存储方式，不再是之前的数据库二进制存储文件了。这意味着您可以使用文本工具来访问数据存储文件（未加密），在访问数据存储文件时，请不要随意修改数据存储文件的任何内容。

# DesktopLaunch
source: Desktop program parameters
ar: معلمات برنامج سطح المكتب
zh_hans: 桌面程序参数

source: Developer:
ar: المطور:
zh_hans: 开发者：

# DeveloperNameToolTip
source: Click to visit the Developer home page
ar: انقر لزيارة الصفحة الرئيسية للمطور
zh_hans: 单击访问开发者主页

# DevelopPurpose
source: Purpose of development
ar: هدف التطوير
zh_hans: 开发目的

# DevelopPurposeDescription
source: The Microsoft Store provides distribution, download, and update access to apps already on the store. But in the latest Microsoft Store, Microsoft requires users to use an online account to download apps from the store. This is a problem for users who never use a Microsoft account and must rely on the store to download their apps. The app uses the official API and the acquisition interface provided by the third-party API, bypassing the official app download channel provided by the Microsoft Store. Users can download the required application installation package offline for independent deployment.
ar: يوفر متجر مايكروسوفت توزيعًا وتنزيلًا وتحديثًا للتطبيقات الموجودة بالفعل على المتجر. ولكن في أحدث متجر مايكروسوفت، تتطلب مايكروسوفت من المستخدمين استخدام حساب عبر الإنترنت لتنزيل التطبيقات من المتجر. هذه مشكلة للمستخدمين الذين لا يستخدمون حساب مايكروسوفت أبدًا ويجب عليهم الاعتماد على المتجر لتنزيل تطبيقاتهم. يستخدم التطبيق واجهة برمجة التطبيقات الرسمية وواجهة الاستحواذ المقدمة من واجهة برمجة التطبيقات التابعة لجهة خارجية، متجاوزًا قناة تنزيل التطبيقات الرسمية المقدمة من متجر مايكروسوفت. يمكن للمستخدمين تنزيل حزمة تثبيت التطبيق المطلوبة بشكل غير متصل للنشر المستقل.
zh_hans: Microsoft Store 提供了对已上架商店应用的分发，下载和更新通道。但是在最新的 Microsoft Store 中，微软要求用户下载商店的应用需要使用在线账户。这对一些从不使用微软账户且应用必须依赖商店下载的用户带来了困扰。该应用使用了 store.rg-adguard.net 提供的获取接口，绕开了 Microsoft Store 官方提供的应用下载渠道。用户可以离线下载所需的应用安装包，进行独立部署。

# Download
source: Download management instructions
ar: تعليمات إدارة التنزيل
zh_hans: 下载管理说明

# DownloadDescription1
source: The download function of the application is not provided by the application itself, it uses the built-in delivery optimization or background intelligent transfer service (BITS) to download files. Therefore, during the download process, a temporary download file in TMP format will appear on the local disk, and the download time will depend on your Internet connection speed.
ar: وظيفة التنزيل في التطبيق ليست مقدمة من التطبيق نفسه، بل تستخدم تحسين التسليم المدمج أو خدمة النقل الذكي في الخلفية (BITS) لتنزيل الملفات. لذلك، أثناء عملية التنزيل، سيظهر ملف تنزيل مؤقت بتنسيق TMP على القرص المحلي، وستعتمد مدة التنزيل على سرعة اتصالك بالإنترنت.
zh_hans: 应用的下载功能并不是由应用本身所提供的，它使用的是开源的Aria2下载工具来下载文件。所以在下载文件的过程中会在本地磁盘出现两个文件，一个是下载文件自己的文件名称，另一个是扩展名为Aria2的下载文件。下载文件的时长取决于您的网络连接速度。

# DownloadDescription2
source: The download link is time-sensitive, and a 404 error will appear if you visit the download link after a certain period of time. Therefore, the application does not support resuming downloads for applications that fail to download. If you have an incomplete download task that has been timed out, we recommend that you re-obtain the link before downloading.
ar: رابط التنزيل حساس للوقت، وستظهر رسالة خطأ 404 إذا قمت بزيارة رابط التنزيل بعد فترة معينة من الوقت. لذلك، لا يدعم التطبيق استئناف التنزيلات للتطبيقات التي فشلت في التنزيل. إذا كان لديك مهمة تنزيل غير مكتملة تم انتهاء وقتها، نوصي بأن تعيد الحصول على الرابط قبل التنزيل.
zh_hans: 下载链接具有时效性，一段时间过后如果访问下载链接就会出现404错误。所以该应用暂不支持下载失败的应用恢复下载。如果您有未完成且链接已经超时的下载任务，建议您重新获取链接后再进行下载。

# DownloadDescription3
source: The download service shuts down due to an exception in some unknown circumstances, and if you encounter a download service that is not running while downloading a file, we recommend that you try restarting the app.
ar: تتوقف خدمة التنزيل بسبب استثناء في بعض الظروف غير المعروفة، وإذا واجهت خدمة تنزيل غير تعمل أثناء تنزيل ملف، نوصي بأن تحاول إعادة تشغيل التطبيق.
zh_hans: 下载服务在一些未知的情况下因为异常而关闭，如果您在下载文件的过程中遇到了下载服务尚未运行，建议您尝试重启应用。

source: Download failed
ar: فشل التنزيل
zh_hans: 下载失败

# DownloadFailedDescription
source: If the download task is in the incomplete list and the message text shows that the download failed, an error has occurred for the download task. You can try the following steps to fix app downloads.
ar: إذا كانت مهمة التنزيل في القائمة غير المكتملة ونص الرسالة يظهر أن التنزيل قد فشل، فقد حدث خطأ في مهمة التنزيل. يمكنك محاولة الخطوات التالية لإصلاح تنزيلات التطبيق.
zh_hans: 当下载任务在未完成列表中，并且提示文字显示下载失败时，说明下载任务发生了错误。您可以尝试以下步骤修复应用下载。

# DownloadFailedStep1
source: 1. Check your device's network connection, please check the "Request Failed" column for specific operations.
ar: 1. تحقق من اتصال الشبكة لجهازك، يرجى التحقق من عمود "طلب فشل" للحصول على العمليات المحددة.
zh_hans: 1.检查您设备的网络连接，具体操作请查看“获取失败”信息一栏。

# DownloadFailedStep2
source: 2. Check whether the download directory you select by default has write permissions, if the directory you select does not allow normal writing, the download task will be abnormal.
ar: 2. تحقق مما إذا كان الدليل الذي تختاره للتنزيل بشكل افتراضي لديه أذونات كتابة، إذا كان الدليل الذي تختاره لا يسمح بالكتابة العادية، فستكون مهمة التنزيل غير طبيعية.
zh_hans: 2.检查您默认选择的下载目录是否有写入权限，如果您选择的目录是不允许正常写入，那么下载任务就会发生异常。

source: Download settings
ar: إعدادات التنزيل
zh_hans: 下载设置

# EncryptedPackageButton
source: Learn about encrypted packages
ar: تعرف على الحزم المشفرة

# EncryptedPackageInstruction
source: The encrypted package files include '.eappx', '.eappxbundle', '.emsix', and '.emsixbundle'
ar: تتضمن ملفات الحزم المشفرة '.eappx'، '.eappxbundle'، '.emsix'، و '.emsixbundle'

# HeaderDescription
source: Welcome to download the GetStoreApp.Wish you a pleasant experience
ar: مرحبًا بك في تنزيل GetStoreApp. نتمنى لك تجربة ممتعة
zh_hans: 欢迎大家下载获取商店应用，祝您使用愉快

# HelpTranslate
source: Help translate app
ar: ساعد في ترجمة التطبيق

# InstallMode
source: Insall mode instructions
ar: تعليمات وضع التثبيت
zh_hans: 应用安装方式说明

# InstallModeDescription1
source: App installation methods are divided into two ways: using application installation and direct installation. By default, it is installed using App Installer.
ar: طرق تثبيت التطبيق مقسمة إلى طريقتين: استخدام تثبيت التطبيق والتثبيت المباشر. بشكل افتراضي، يتم تثبيته باستخدام مثبت التطبيق.
zh_hans: 应用安装方式分为使用应用程序安装和直接安装两种方式。默认情况下是使用应用安装程序安装。

# InstallModeDescription2
source: The downloaded application package may contain some library dependencies, in the installation process if you do not know these things very well, it is recommended that you use the application installer to install, this way will automatically analyze the library dependencies in the installation package, background download device does not have installed dependencies and install in the background.
ar: قد تحتوي حزمة التطبيق التي تم تنزيلها على بعض تبعيات المكتبة، في عملية التثبيت إذا كنت لا تعرف هذه الأمور جيدًا، يُوصى باستخدام مثبت التطبيق للتثبيت، بهذه الطريقة سيتم تحليل تبعيات المكتبة تلقائيًا في حزمة التثبيت، ويقوم الجهاز بتنزيل الخلفية بتثبيت التبعيات غير المثبتة في الخلفية.
zh_hans: 下载得到的应用包中可能会包含一些库依赖包，在安装过程中如果您对这些内容不是很了解，建议您使用应用安装程序安装，该方式会自动分析安装包里面的库依赖包，后台下载设备没有安装的依赖包并在后台安装。

# InstallModeDescription3
source: If the version of the operating system you're using doesn't include an app installer, we recommend that you download the dependent packages as well as the app download. After the download is complete, use Direct Install, installing the dependent package first, and then installing the main app package. Once installed, the app will be up and running.
ar: إذا كانت نسخة نظام التشغيل التي تستخدمها لا تتضمن مثبت تطبيق، نوصي بتنزيل الحزم المعتمدة بالإضافة إلى تنزيل التطبيق. بعد اكتمال التنزيل، استخدم التثبيت المباشر، وتثبيت الحزمة المعتمدة أولاً، ثم تثبيت الحزمة الرئيسية للتطبيق. بمجرد التثبيت، سيكون التطبيق جاهزًا للعمل.
zh_hans: 如果你使用的操作系统版本中没有包含应用安装程序，建议您在下载应用的过程中同时将依赖包一并下载。下载完成后使用直接安装，先安装依赖包，然后安装主应用包。安装成功后即可正常运行应用。

# Language
source: Language setting insturctions
ar: تعليمات إعداد اللغة
zh_hans: 界面语言设置说明

# LanguageDescription
source: The name of the Start menu app doesn't change with the app language setting. Find the app in settings and click the Repair button and the app name changes without clearing your app's data.
ar: اسم تطبيق قائمة البدء لا يتغير مع إعداد لغة التطبيق. ابحث عن التطبيق في الإعدادات وانقر على زر الإصلاح وسيتغير اسم التطبيق دون مسح بيانات التطبيق الخاصة بك.
zh_hans: "开始"菜单应用的名称并不会跟随应用语言设置发生改变。请在设置中找到应用点击修复按钮，应用名称随即发生改变，这不会清除您应用的数据。

source: Launch parameters
ar: معلمات الإطلاق
zh_hans: 启动参数

# LaunchParametersDescription
source: The desktop application now supports parameter operation, please click the parameter description below for specific usage
ar: يدعم تطبيق سطح المكتب الآن تشغيل المعلمات، يرجى النقر على وصف المعلمات أدناه للاستخدام المحدد
zh_hans: 桌面应用程序现在已经开始支持参数运行了，具体的使用方法请点击下方的参数说明

source: Learn bits
ar: تعلم عن BITS

source: Learn delivery optimization
ar: تعلم عن تحسين التسليم

# LearnWinGetConfig
source: learn config options
ar: تعلم خيارات التكوين
zh_hans: 了解配置选项

# LinkFilter
source: Link filtering instructions
ar: تعليمات تصفية الروابط
zh_hans: 链接过滤说明

# MicrosoftStore
source: 1. Microsoft Store
ar: 1. متجر مايكروسوفت
zh_hans: 1.微软商店

# MicrosoftStoreDescription
source: Once the app opens, select the type of link and channel you want to get. When the selection is complete, enter the link content you want to get, and when the input is complete, click the 'Get Link' button to get the app installation package corresponding to the store link. After successful acquisition, your input record will be stored, and the next time you open the app, you can quickly get the app installation package corresponding to the store link.
ar: بمجرد فتح التطبيق، اختر نوع الرابط والقناة التي تريد الحصول عليها. عند الانتهاء من الاختيار، أدخل محتوى الرابط الذي ترغب في الحصول عليه، وعند الانتهاء من الإدخال، انقر على زر "احصل على الرابط" للحصول على حزمة تثبيت التطبيق المقابلة لرابط المتجر. بعد الحصول الناجح، سيتم حفظ سجل إدخالك، وفي المرة القادمة التي تفتح فيها التطبيق، يمكنك بسرعة الحصول على حزمة تثبيت التطبيق المقابلة لرابط المتجر.
zh_hans: 应用打开后，选择您要获取的链接类型和通道类型。选择完成后，输入您要获取的链接内容，输入完成后，点击‘获取链接’按钮即可获取到商店链接对应的应用安装包。在成功获取后，您的输入记录将被储存，下一次打开应用后就可以快速获取到商店链接对应的应用安装包。

source: Others
ar: أخرى
zh_hans: 其他

# OthersToolTip
source: Other options
ar: خيارات أخرى
zh_hans: 其他选项

# PaidApps
source: Please download the paid app from the official channel
ar: يرجى تنزيل التطبيق المدفوع من القناة الرسمية
zh_hans: 付费应用请从官方渠道下载

# PaidAppsDescription
source: Microsoft has restricted the operation of paid apps in Windows systems, and paid apps that have not been purchased cannot function properly after installation through offline installation packages. If you have a paid app that you've already purchased, download it from the Microsoft Store.
ar: قيدت مايكروسوفت تشغيل التطبيقات المدفوعة في أنظمة ويندوز، ولا يمكن أن تعمل التطبيقات المدفوعة التي لم يتم شراؤها بشكل صحيح بعد التثبيت من خلال حزم التثبيت غير المتصلة. إذا كان لديك تطبيق مدفوع قمت بشرائه بالفعل، قم بتنزيله من متجر مايكروسوفت.
zh_hans: 微软在 Windows 系统中对付费应用的运行进行了限制，没有购买的付费应用是不能通过离线安装包安装后正常运行的。如果您有已经购买的付费应用，请从 Microsoft Store 中下载。

source: Pin to desktop
ar: تثبيت على سطح المكتب

# PinToDesktopToolTip
source: Pin the app to desktop
ar: تثبيت التطبيق على سطح المكتب

source: Pin to start screen
ar: تثبيت على شاشة البدء
zh_hans: 固定到”开始“屏幕

# PinToStartScreenToolTip
source: Pin the app to Start screen
ar: تثبيت التطبيق على شاشة البدء
zh_hans: 将应用固定到“开始”屏幕

source: Pin to taskbar
ar: تثبيت على شريط المهام
zh_hans: 固定到任务栏

# PinToTaskbarToolTip
source: Pin the app to taskbar
ar: تثبيت التطبيق على شريط المهام
zh_hans: 将应用固定到任务栏

# Precaution
source: Precautions
ar: احتياطات
zh_hans: 注意事项

source: Privacy and Security
ar: الخصوصية والأمان
zh_hans: 隐私安全

# PrivacyandSecurityDescription
source: All of the app's code is open source on Github, and all code can be read on its own. The history involved in the app is stored in the app's cache folder and is not uploaded over the network. All content is also deleted when the app is uninstalled or reset. When downloading an app, make sure that you get the app from a reliable source, and the only address you currently specify is the Release page of the Github repository.
ar: كود التطبيق بالكامل مفتوح المصدر على Github، ويمكن قراءة جميع الأكواد بمفردها. التاريخ المتعلق بالتطبيق مخزن في مجلد ذاكرة التخزين المؤقت للتطبيق ولا يتم رفعه عبر الشبكة. يتم أيضًا حذف جميع المحتويات عند إلغاء تثبيت التطبيق أو إعادة تعيينه. عند تنزيل تطبيق، تأكد من أنك تحصل على التطبيق من مصدر موثوق، والعنوان الوحيد الذي تحدده حاليًا هو صفحة الإصدار لمستودع Github.
zh_hans: 应用的所有代码在 Github 上开源，所有代码都可以自行阅读。应用中涉及到的历史记录都存储在应用的缓存文件夹中，不会通过网络上传。应用在卸载或重置时所有的内容也会一并删除。在下载应用时请确保您获取应用的来源可靠，目前指定的唯一地址就是 Github 仓库的 Release 页面。

source: Project home page
ar: الصفحة الرئيسية للمشروع
zh_hans: 项目主页

# Reference
source: Project references (Sort by alphabetical order)
ar: مراجع المشروع (ترتيب أبجدي)
zh_hans: 项目引用（按英文首字母排序）

# ReferenceToolTip
source: Click to learn about the referenced open source project
ar: انقر لتتعلم عن المشروع المفتوح المصدر المشار إليه
zh_hans: 单击了解被引用开源项目的信息

source: Request failed
ar: فشل الطلب
zh_hans: 获取失败

# RequestFailedDescription
source: If the background of the message bar turns red, it means that an error has occurred in your request. You can get information through the "View" button in the information status bar. After you understand the specific cause of the error, you can do the following.
ar: إذا تحول خلفية شريط الرسالة إلى اللون الأحمر، فهذا يعني أن خطأ قد حدث في طلبك. يمكنك الحصول على المعلومات من خلال زر "عرض" في شريط حالة المعلومات. بعد أن تفهم السبب المحدد للخطأ، يمكنك القيام بما يلي.
zh_hans: 如果信息提示栏的背景变成红色，那么就说明您的本次请求发生了错误。您可以通过信息状态栏的“查看”按钮获取相关信息。在了解了具体的错误原因后，您可以进行以下操作。

# RequestFailedStep1
source: 1. Networks in different regions may have different conditions. If the error is caused by network connection timeout, you can try to retrieve it again.
ar: 1. قد تكون الشبكات في مناطق مختلفة لها ظروف مختلفة. إذا كان الخطأ ناتجًا عن انتهاء مهلة اتصال الشبكة، يمكنك محاولة استعادته مرة أخرى.
zh_hans: 1.不同地区的网络可能存在不同的状况。如果是因为网路连接超时引起的错误，您可以尝试重新获取。

# RequestFailedStep2
source: 2. Only the correct link will get the app installation package, please check if the link you entered is correct.
ar: 2. فقط الرابط الصحيح سيحصل على حزمة تثبيت التطبيق، يرجى التحقق مما إذا كان الرابط الذي أدخلته صحيحًا.
zh_hans: 2.只有正确的链接才能获取应用安装包，请检查您输入的链接是否正确。

# RequestFailedStep3
source: 3. The app needs networking to send a get request. Check your device's network condition and wait until your device's network connection is working properly to try to regain it.
ar: 3. يحتاج التطبيق إلى الاتصال بالشبكة لإرسال طلب الحصول. تحقق من حالة شبكة جهازك وانتظر حتى يعمل اتصال الشبكة بشكل صحيح لتجربة استعادته مرة أخرى.
zh_hans: 3.应用需要联网功能才能发送获取请求。请检查您设备的网络情况，待到您设备的网络连接正常后尝试重新获取。

# RequestFailedStep4
source: 4. If you encounter other unknown issues, it is recommended that you use the web browser.
ar: 4. إذا واجهت مشكلات أخرى غير معروفة، يُوصى باستخدام متصفح الويب.
zh_hans: 4.如果网页开启了Cloudflare 5秒验证（防火墙），建议您使用网页版。网页版已经对接下载接口。

source: Send feedback
ar: إرسال ملاحظات
zh_hans: 发送反馈

# SettingsHelp
source: Setting options instructions
ar: تعليمات خيارات الإعداد
zh_hans: 设置选项说明

source: Show License
ar: عرض الترخيص
zh_hans: 查看许可证

# ShowLicenseToolTip
source: View the app's license agreement
ar: عرض اتفاقية ترخيص التطبيق
zh_hans: 查看应用的许可协议

source: Show release notes
ar: عرض ملاحظات الإصدار
zh_hans: 查看更新日志

# ShowReleaseNotesToolTip
source: Learn about app-specific updates
ar: تعرف على التحديثات الخاصة بالتطبيق
zh_hans: 了解应用具体的更新内容

# SystemInformation
source: View system information
ar: عرض معلومات النظام
zh_hans: 查看系统信息

# Thanks
source: Thanks (Sort by alphabetical order)
ar: شكرًا (ترتيب أبجدي)
zh_hans: 感谢（按英文首字母排序）

# ThanksDescription
source: The road to development is long and obstructive. Thank you very much for the support of these friends.
ar: طريق التطوير طويل ومليء بالعقبات. شكرًا جزيلاً لدعم هؤلاء الأصدقاء.
zh_hans: 开发之路，道阻且长。非常感谢这些朋友的支持。

# ThanksToolTip
source: Click Learn about the thank-your's personal information
ar: انقر لتتعلم عن المعلومات الشخصية للشكر
zh_hans: 单击了解该感谢者的个人信息

# Title
source: About
ar: حول
zh_hans: 关于

source: Trouble shoot
ar: استكشاف الأخطاء وإصلاحها
zh_hans: 疑难解答

source: Update path
ar: مسار التحديث
zh_hans: 更新途径

# UpdatePathDescription
source: Apps listed on the Microsoft Store can only be downloaded or updated through the Microsoft Store and are not allowed to be downloaded and installed through other third-party channels. This practice ensures the reliability of the application source path. As a result, the app somehow violates the policies of the Microsoft Store and cannot be listed in the Microsoft Store. You can open the release page of the project by "Check for Updates", find the latest version of the app yourself, and download the installation package in MSIX format for the project to update.
ar: يمكن تنزيل التطبيقات المدرجة في متجر مايكروسوفت أو تحديثها فقط من خلال متجر مايكروسوفت، ولا يُسمح بتنزيلها وتثبيتها من خلال قنوات طرف ثالث أخرى. تضمن هذه الممارسة موثوقية مسار مصدر التطبيق. نتيجة لذلك، ينتهك التطبيق بطريقة ما سياسات متجر مايكروسوفت ولا يمكن إدراجه في متجر مايكروسوفت. يمكنك فتح صفحة الإصدار للمشروع من خلال "التحقق من التحديثات"، والعثور على أحدث إصدار من التطبيق بنفسك، وتنزيل حزمة التثبيت بتنسيق MSIX لتحديث المشروع.
zh_hans: Microsoft Store 上架的应用只能通过 Microsoft Store 进行下载或更新，不允许通过其他第三方渠道进行下载安装。这种做法保证了应用来源途径的可靠性。因此，该应用在某种程度上违背了 Microsoft Store 的政策，无法在 Microsoft Store 中上架。您可以通过“检查更新”打开项目的发布页面，自行查找应用的最新版本，下载该项目 MSIX 格式的安装包进行更新。

# UseInstruction
source: Direction for use
ar: تعليمات الاستخدام
zh_hans: 使用说明

# WinGetConfig
source: WinGet config options description
ar: وصف خيارات تكوين WinGet
zh_hans: WinGet 配置选项说明

# WinGetConfigDescription
source: The Windows package Manager client experience can be customized by customizing WinGet's configuration file. You can change the default values and experiment with the experimental features already implemented in the client.
ar: يمكن تخصيص تجربة عميل Windows Package Manager من خلال تخصيص ملف تكوين WinGet. يمكنك تغيير القيم الافتراضية وتجربة الميزات التجريبية التي تم تنفيذها بالفعل في العميل.
zh_hans: 通过自定义 WinGet 的配置文件可以自定义 Windows 程序包管理器客户端体验。 你可以更改默认值，并体验已在客户端中实现的试验性功能。

# WinGetPackage
source: 2. WinGet package
ar: 2. حزمة WinGet
zh_hans: 2.WinGet 程序包

# WinGetPackageDescription1
source: Windows Package Manager is a comprehensive package manager solution that consists of a command line tool and set of services for installing applications on Windows 10 and Windows 11.
ar: مدير حزم ويندوز هو حل شامل لإدارة الحزم يتكون من أداة سطر أوامر ومجموعة من الخدمات لتثبيت التطبيقات على ويندوز 10 وويندوز 11.
zh_hans: Windows 程序包管理器是一个综合的程序包管理器解决方案，由一个命令行工具和一组用于在 Windows 10 和 Windows 11 上安装应用程序的服务组成。

# WinGetPackageDescription2
source: The WinGet application provides a package-friendly graphical interface that includes searching and installing required applications, managing installed and upgradeable applications on the device. It is easy to operate and manage traditional applications (i.e. non-store applications) on the device.
ar: يوفر تطبيق WinGet واجهة رسومية صديقة للحزم تشمل البحث وتثبيت التطبيقات المطلوبة، وإدارة التطبيقات المثبتة وقابلة للتحديث على الجهاز. من السهل تشغيلها وإدارة التطبيقات التقليدية (أي التطبيقات غير المتجر) على الجهاز.
zh_hans: 应用提供了 WinGet 程序包友好的图形化操作界面，其中包括搜索并安装需要的应用，管理设备上已安装的应用和可升级的应用。方便对设备上的传统应用（即非商店应用）进行操作和管理。

# Backdrop
source: Backdrop settings instructions
zh_hans: 背景色设置说明

# BackdropDescription
source: Windows 10 (earlier than 22000) does not support mica backdrop
zh_hans: Windows 10系统（版本号低于22000）不支持云母背景色
